[
  {
    "id": 1,
    "position": 1,
    "startAt": "01-01-2015",
    "endAt": "04-01-2018",
    "companyName": "SIAT Informática",
    "website": "http://siat.com.br/",
    "logo": "assets/template/experience/logo/siat-logo.png",
    "internationalizations": [
      {
        "language": "pt",
        "city": "Belo Horizonte",
        "country": "Brasil",
        "role": "Analista de sistemas e desenvolvedor .net",
        "description": "A <b>SIAT Informática LTDA</b> é uma empresa focada em soluções logísticas, seu principal produto é um <i>ERP integrado</i>, que fornece controle total da empresa como financeiro, inventório, roteirização, fiscal, contábil. <br><br>Na <i>SIAT Informática LTDA</i>, entrei em contato com desenvolvedores seniores, aprendendo as melhores práticas, padrões e como debater idéias e oferecer soluções diversas para o mesmo problema. Foi o ponto de partida, uma oportunidade única de transformar o conhecimento teórico em soluções concretas que estavam sendo usadas por centenas de pessoas todos os dias. Tive contato com aplicações WPF, ASPNET MVC, WebAPI's, serviços windows, aplicações mobile usando flutter/dart, contato com banco de dados Microsoft SQL."
      },
      {
        "language": "en",
        "city": "Belo Horizonte",
        "country": "Brazil",
        "role": "SYSTEM ANALYST AND .NET DEVELOPER",
        "description": "<b>SIAT Informática LTDA</b> is a company focused on logistics solutions, its main product is an <i>integrated ERP</i>, which provides total control of the company such as finance, inventory, routing, tax, accounting . <br><br>At <i>SIAT Informática LTDA</i>, I got in touch with senior developers, learning best practices, patterns and how to debate ideas and offer different solutions for the same problem. It was the starting point, a unique opportunity to transform theoretical knowledge into concrete solutions that were being used by hundreds of people every day. I had contact with WPF applications, ASPNET MVC, WebAPI's, windows services, mobile applications using flutter/dart, contact with MS SQL database."
      }
    ],
    "technologies": [
      "C#",
      ".NET",
      "Entity Framework",
      "IIS",
      "Dart",
      "Flutter",
      "WPF",
      "SOAP",
      "WebAPI",
      "Wordpress",
      "Azure Devops",
      "SQL",
      "Windows"
    ],
    "medias": [
    ],
    "backgroundUrl": "assets/template/experience/bh.jpg"
  },
  {
    "id": 2,
    "position": 2,
    "startAt": "04-01-2018",
    "endAt": "12-01-2020",
    "companyName": "Reply",
    "website": "https://www.reply.com/br/",
    "logo": "assets/template/experience/logo/reply-logo.png",
    "internationalizations": [
      {
        "language": "pt",
        "city": "Belo Horizonte",
        "country": "Brasil",
        "role": "DESENVOLVEDOR .NET",
        "description": "A <b>E-tática</b> é uma agência especializada em soluções para <i>comércio eletrônico</i>, marketing digital e identidade visual desde 2008, trabalhando com grandes, pequenos e médios negócios, oferecendo para seus clientes, o know-how na integração de seus negócios com <i>Sistemas integrados de gestão empresarial (ERP)</i> e <i>APIs de terceiros</i>, tais como <i>provedores de pagamento personalizados</i>, fazendo a integração do gerenciamento interno da plataforma on-line e da loja física, sendo certificada pelas principais plataformas do mercado.<br><br>Na <i>E-tática </i>, trabalhei para desenvolver soluções personalizadas para clientes do atacado e varejo, valorizando a qualidade e a continuidade dos projetos a médio e longo prazo."
      },
      {
        "language": "en",
        "city": "Belo Horizonte",
        "country": "Brazil",
        "role": ".NET DEVELOPER",
        "description": "<b>E-tática</b> is an agency specialized in solutions for <i>e-commerce</i>, digital marketing, and visual identity since 2008, working with large, small, and medium-sized businesses, offering to their clients the know-how in the integration of <i>enterprise resource planning (ERP)</i> and <i>third-party APIs</i>, such as custom <i>payment providers</i>. It does the integration of the internal management of the online platform and physical store, being certified by the main platforms in the market.<br><br>At <i>E-tática</i> I have worked to develop custom solutions for clients wholesale and retail, valuing the quality and continuity of projects in the medium and long term."
      }
    ],
    "technologies": [
      "Magento 1.X",
      "PHP",
      "Zend Framework",
      "HTML",
      "CSS",
      "CSS3",
      "Javascript",
      "jQuery",
      "SOAP",
      "Wordpress",
      "SVN",
      "Payment Services",
      "SSH",
      "SSL",
      "Linux"
    ],
    "medias": [
    ],
    "backgroundUrl": "assets/template/experience/bh.jpg"
  },
  {
    "id": 3,
    "position": 3,
    "startAt": "02-01-2020",
    "endAt": "02-01-2021",
    "companyName": "Squadra",
    "website": "https://www.squadra.com.br/",
    "logo": "assets/template/experience/logo/squadra-logo.png",
    "internationalizations": [
      {
        "language": "pt",
        "city": "São Paulo",
        "country": "Brasil",
        "role": "DESENVOLVEDOR .NET SENIOR",
        "description": "A <b>Deevo Studio</b> é uma agência especializada em <i>web design</i> e <i>desenvolvimento</i> com um extenso portfólio de casos de sucesso, resultado de mais de <i>20 anos</i> de experiência com diversas agências e no mercado corporativo. Suas criações envolvem tudo, desde o desenvolvimento da marca e identidade visual, até a criação de aplicativos e sites, com um amplo conhecimento do Wordpress e das tecnologias da web. <br><br>Na <i>Deevo Studio</i>, tive a chance de usar o conhecimento anterior de <i>back-end</i> combinado com a experiência prática no desenvolvimento JAVA para aceitar o desafio de iniciar um <i>Departamento de Desenvolvimento Android</i> na empresa, fornecendo complexos <i>Aplicativos Android</i> para empresas no Brasil."
      },
      {
        "language": "en",
        "city": "São Paulo",
        "country": "Brazil",
        "role": "SENIOR .NET DEVELOPER ",
        "description": "At <b>Deevo Studio</b> is a company specializing in <i>web design</i> and <i>development</i> with an extensive portfolio of cases, the result of <i>20 years</i> of experience with other agencies and the corporate market. Their creations involve everything from brand development and visual identity to the creation of applications and websites, with a wide knowledge of Wordpress and Web Technologies.<br><br>At <i>Deevo Studio</i>, I had the chance to use the previously back-end knowledge combined with practical experience in JAVA development to accept the challenge to start an <i>Android Development Department</i> in the company, delivering complex <i>Android Applications</i> to companies in Brazil."
      }
    ],
    "technologies": [
      ".NET",
      "Azure",
      "Aspnet",
      "Windows Forms",
      "SQL",
      "MongoDB",
      "PHP",
      "Slim Framework",
      "Laravel",
      "SMTP",
      "Versioning Control",
      "BitBucket",
      "Jira",
      "Git",
      "Kanban framework"
    ],
    "medias": [
    ],
    "backgroundUrl": "assets/template/experience/sao-paulo.jpg"
  },
  {
    "id": 4,
    "position": 4,
    "startAt": "01-02-2021",
    "endAt": "01-02-2022",
    "companyName": "F1 Solutions",
    "website": "https://www.f1solutions.com.au/",
    "logo": "assets/template/experience/logo/f1-solutions-logo.png",
    "internationalizations": [
      {
        "language": "pt",
        "city": "Canberra",
        "country": "Australia",
        "role": "Desenvolvedor Full-stack",
        "description": "Na <b>Skydreamer Startup</b>, fui convidado para fazer parte da equipe de desenvolvimento do primeiro aplicativo móvel europeu que transformaria o planejamento de viagens entre amigos em um <i>Jogo de Swipe & Match</i>, oferecendo milhares de destinos em todo o mundo. Sempre com as melhores ofertas de voos, hotéis e apartamentos.<br><br>Na <i>Skydreamer</i>, tive a incrível experiência de vivenciar um <i> ambiente de startup</i>, os prós e os contras , expandindo minha mente de como liderar com o gerenciamento remoto, com prazos curtos e recursos muito limitados. Em setembro de 2017, com a versão <i>Beta</i> em execução e com vários usuários reais, fomos até a <i>TechCrunch Disrupt<i> em São Francisco, onde recebemos uma oferta de uma agência internacional de esportes e entretenimento."
      },
      {
        "language": "en",
        "city": "Canberra",
        "country": "Australia",
        "role": "Full-stack Developer",
        "description": "At <b>F1 Solutions</b>, I was working with an aspnet application that uses DevExpress toolkit, typescript, .net framework. I was were working updating libraries like bootstrap, jquery and others to newer version, keeping compatibility. Doing maintenance and helping support team to identify issues and client requirements. Also working closely with UX-UI team to delivery new features. "
      }
    ],
    "technologies": [
      ".NET",
      "DevExpress",
      "HTML5",
      "CSS3",
      "Javascript",
      "Typescript",
      "jQuery",
      "Entity Framework",
      "MS SQL",
      "IIS",
      "Azure",
      "Unit Tests",
      "TDD"
    ],
    "medias": [
    ],
    "backgroundUrl": "assets/template/experience/utrecht.jpg"
  },
  {
    "id": 5,
    "position": 5,
    "startAt": "01-04-2022",
    "companyName": "BairesDev",
    "website": "https://www.bairesdev.com/",
    "logo": "assets/template/experience/logo/bairesdev-logo.png",
    "internationalizations": [
      {
        "language": "pt",
        "city": "Arizona",
        "country": "EUA",
        "role": "Engenheiro de Software",
        "description": "Na <b>BairesDev</b>, eu estava encarregado de ser o <i>Tech Leader</i> de back-end, trabalhando com <i>.NET + Azure and AWS</i> para um grande fornecedor americano de tecnologia para empresas de transportes.<br><br>Na <i>QAT Global</i>, assegurei de que todos os desenvolvedores aplicassem as melhores práticas e padrões necessários para um aplicativo corporativo de <i>alta disponibilidade</i>, melhorando não apenas minhas habilidades técnicas, mas também as habilidades interpessoais."
      },
      {
        "language": "en",
        "city": "Arizona",
        "country": "USA",
        "role": "Software Engineer",
        "description": "At <b>BairesDev</b>, I was in charge of being the <i>Tech Leader</i> in the back-end side, working with <i>.NET + Azure and AWS</i> for one big <i>American Technology</i> provider of solutions to logistics companies.<br><br>At <i>BairesDev</i>, I made sure that all the developers were applying the best patterns, practices, and standards needed for an enterprise application of <i>high availability</i> needs, improving not only my technical skills but also the soft skills."
      }
    ],
    "technologies": [
      ".NET",
      "Azure",
      "Aws",
      "Aspnet",
      "Entity Framework",
      "Kafka",
      "RabbitMQ",
      "K8s",
      "SOLID",
      "Redis",
      "MS SQL",
      "Git",
      "GitLab",
      "Jenkins",
      "ArgoCD"
    ],
    "medias": [
    ],
    "backgroundUrl": "assets/template/experience/arizona.jpeg"
  }
]
